# ImportInstance Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImportInstance Class
Members See Also
---
An element created during either import or link operation. It is an instance of CADLinkType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ImportInstance : Instance
```

Visual Basic
---
```text
Public Class ImportInstance _
	Inherits Instance
```

Visual C++
---
```text
public ref class ImportInstance : public Instance
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..Instance Autodesk.Revit.DB..::..ImportInstance
# See Also
ImportInstance Members
Autodesk.Revit.DB Namespace